Ran Plan for 2 projects:

1. dir: `resources/aws/staging/ec2/vm-pendapatan` workspace: `default`
1. dir: `resources/aws/staging` workspace: `default`

### 1. dir: `resources/aws/staging/ec2/vm-pendapatan` workspace: `default`
<details><summary>Show Output</summary>

```diff
Initializing the backend...

Initializing provider plugins...
- Finding hashicorp/aws versions matching "4.51.0"...
- Installing hashicorp/aws v4.51.0...
- Installed hashicorp/aws v4.51.0 (signed by HashiCorp)

Terraform has created a lock file .terraform.lock.hcl to record the provider
selections it made above. Include this file in your version control repository
so that Terraform can guarantee to make the same selections by default when
you run "terraform init" in the future.

Terraform has been successfully initialized!

You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_instance.vm-test will be created
  + resource "aws_instance" "vm-test" {
      + ami                                  = "ami-0261755bbcb8c4a84"
      + arn                                  = (known after apply)
      + associate_public_ip_address          = (known after apply)
      + availability_zone                    = (known after apply)
      + cpu_core_count                       = (known after apply)
      + cpu_threads_per_core                 = (known after apply)
      + disable_api_stop                     = (known after apply)
      + disable_api_termination              = (known after apply)
      + ebs_optimized                        = (known after apply)
      + get_password_data                    = false
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      + iam_instance_profile                 = (known after apply)
      + id                                   = (known after apply)
      + instance_initiated_shutdown_behavior = (known after apply)
      + instance_state                       = (known after apply)
      + instance_type                        = "t3.micro"
      + ipv6_address_count                   = (known after apply)
      + ipv6_addresses                       = (known after apply)
      + key_name                             = "lab-deployer"
      + monitoring                           = (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_partition_number           = (known after apply)
      + primary_network_interface_id         = (known after apply)
      + private_dns                          = (known after apply)
      + private_ip                           = (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      + secondary_private_ips                = (known after apply)
      + security_groups                      = (known after apply)
      + source_dest_check                    = true
      + subnet_id                            = (known after apply)
      + tags                                 = {
          + "Name" = "vm-pendapatan"
        }
      + tags_all                             = {
          + "Name" = "vm-pendapatan"
        }
      + tenancy                              = (known after apply)
      + user_data                            = (known after apply)
      + user_data_base64                     = (known after apply)
      + user_data_replace_on_change          = false
      + vpc_security_group_ids               = [
          + "sg-006f88ca37f1d1e3f",
        ]
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + public_ip = (known after apply)

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: /root/.atlantis/repos/rudikarangloi/Terraform-studidevops/2/default/resources/aws/staging/ec2/vm-pendapatan/default.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "/root/.atlantis/repos/rudikarangloi/Terraform-studidevops/2/default/resources/aws/staging/ec2/vm-pendapatan/default.tfplan"
```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d resources/aws/staging/ec2/vm-pendapatan`
* :put_litter_in_its_place: To **delete** this plan click [here](http://34.126.77.33/lock?id=rudikarangloi%252FTerraform-studidevops%252Fresources%252Faws%252Fstaging%252Fec2%252Fvm-pendapatan%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d resources/aws/staging/ec2/vm-pendapatan`
</details>
Plan: 1 to add, 0 to change, 0 to destroy.

---
### 2. dir: `resources/aws/staging` workspace: `default`
**Plan Error**
<details><summary>Show Output</summary>

```
running "terragrunt plan --terragrunt-non-interactive -no-color -out=$PLANFILE $DESTROY_PARAMETER" in "/root/.atlantis/repos/rudikarangloi/Terraform-studidevops/2/default/resources/aws/staging": exit status 1: running "terragrunt plan --terragrunt-non-interactive -no-color -out=$PLANFILE $DESTROY_PARAMETER" in "/root/.atlantis/repos/rudikarangloi/Terraform-studidevops/2/default/resources/aws/staging": 
Terraform initialized in an empty directory!

The directory has no Terraform configuration files. You may begin working
with Terraform immediately by creating Terraform configuration files.

Error: No configuration files

Plan requires configuration to be present. Planning without a configuration
would mark everything for destruction, which is normally not what is desired.
If you would like to destroy everything, run plan with the -destroy option.
Otherwise, create a Terraform configuration file (.tf file) and try again.
time=2023-05-26T10:38:36Z level=error msg=Terraform invocation failed in /root/.atlantis/repos/rudikarangloi/Terraform-studidevops/2/default/resources/aws/staging
time=2023-05-26T10:38:36Z level=error msg=1 error occurred:
	* exit status 1




```
</details>

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`